import { TimelinePeriod } from '../../types/timeLineBlocks.types';

/**
 * Массив с моковыми данными для временных отрезков.
 */
export const mockData: TimelinePeriod[] = [
  {
    theme: 'Спортивный дрифт',
    events: [
      {
        date: '2008',
        description: 'Первый чемпионат мира по дрифту D1GP, прошедший в Токио, Япония, с участием российских пилотов.',
      },
      {
        date: '2010',
        description:
          'Формирование Drift Allstars – крупной международной серии соревнований по дрифту, где участвовали и российские гонщики.',
      },
      {
        date: '2013',
        description:
          'Формула D расширяет свою географию и проводит этапы в Азии, российские дрифт-пилоты также показывают хорошие результаты.',
      },
      {
        date: '2016',
        description:
          'Создание FIA Intercontinental Drifting Cup – первого официального чемпионата мира по дрифту, российские пилоты среди участников.',
      },
      {
        date: '2018',
        description:
          'Российский дрифтер Георгий Чивчян выигрывает чемпионат RDS GP, а дрифт продолжает набирать популярность в России.',
      },
      {
        date: '2021',
        description: 'Формула D становится основным направлением для профессиональных дрифт-пилотов, включая россиян.',
      },
      {
        date: '2023',
        description:
          'Формирование глобальной лиги дрифта, объединяющей чемпионаты по всему миру, включая российский RDS GP.',
      },
    ],
  },
  {
    theme: 'Дизайн',
    events: [
      {
        date: '2002',
        description: 'Основание компании Behance – ключевой платформы для дизайнеров, включая российских специалистов.',
      },
      {
        date: '2004',
        description:
          'Запуск Adobe Creative Suite – изменение мира графического дизайна, широко используемого в России.',
      },
      {
        date: '2007',
        description:
          'Apple представила iPhone, что открыло новые горизонты для UX/UI-дизайна, который быстро адаптировался в России.',
      },
      {
        date: '2010',
        description:
          'Появление Flat Design – нового стиля, который стал популярным в веб-дизайне, включая российские проекты.',
      },
      {
        date: '2012',
        description:
          'Материальный дизайн от Google – новый подход к дизайну интерфейсов, использующийся в российских приложениях.',
      },
      {
        date: '2015',
        description:
          'Рост популярности анимаций и микроинтеракций в веб-дизайне, которые активно используются в российских стартапах.',
      },
    ],
  },
  {
    theme: 'Наука',
    events: [
      {
        date: '2015',
        description: '13 сентября – частное солнечное затмение, видимое в Южной Африке и части Антарктиды.',
      },
      {
        date: '2016',
        description: '14 марта – успешный запуск миссии ExoMars с российским прибором для поиска жизни на Марсе.',
      },
      {
        date: '2017',
        description: '26 апреля – открытие нового состояния материи – времени-кристалла.',
      },
      {
        date: '2018',
        description: '12 сентября – успешное завершение миссии "Роскосмоса" по доставке экипажа на МКС.',
      },
      {
        date: '2019',
        description: '10 апреля – первое изображение черной дыры, сделанное проектом Event Horizon Telescope.',
      },
      {
        date: '2020',
        description: 'Март – разработка первой вакцины против COVID-19 в России "Спутник V".',
      },
      {
        date: '2021',
        description: '20 июля – первый полет в космос с экипажем на борту корабля New Shepard компании Blue Origin.',
      },
      {
        date: '2022',
        description: '25 декабря – успешный запуск космического телескопа Джеймса Уэбба для исследования Вселенной.',
      },
    ],
  },
  {
    theme: 'Литература',
    events: [
      {
        date: '2001',
        description:
          'Публикация романа "Гарри Поттер и философский камень" в России, который стал культовым среди молодежи.',
      },
      {
        date: '2003',
        description:
          'Выход романа "Код да Винчи" Дэна Брауна, вызвавший огромный интерес по всему миру, включая Россию.',
      },
      {
        date: '2005',
        description: 'Нобелевская премия по литературе присуждена Гарольду Пинтеру за вклад в драматургию.',
      },
      {
        date: '2007',
        description: 'Выход финальной книги серии о Гарри Поттере – "Гарри Поттер и Дары Смерти".',
      },
      {
        date: '2008',
        description: 'Публикация романа "Сумерки" Стефани Майер, который быстро стал популярным в России.',
      },
      {
        date: '2009',
        description: 'Присуждение премии "Большая книга" роману Людмилы Улицкой "Даниэль Штайн, переводчик".',
      },
      {
        date: '2010',
        description: 'Сергей Лукьяненко публикует роман "Новая Стража", продолжение серии "Дозоров".',
      },
    ],
  },
  {
    theme: 'Спорт',
    events: [
      {
        date: '1992',
        description: 'Олимпийские игры в Барселоне – участие Объединенной команды СНГ, завоевавшей множество медалей.',
      },
      {
        date: '1994',
        description: 'Футбольный чемпионат мира в США – Россия впервые принимает участие после распада СССР.',
      },
      {
        date: '1996',
        description: 'Майкл Джордан возвращается в NBA, в то время как Россия принимает участие в Олимпиаде в Атланте.',
      },
      {
        date: '1998',
        description:
          'Франция выигрывает Чемпионат мира по футболу, а российская футбольная команда показывает хорошие результаты.',
      },
      {
        date: '2000',
        description: 'Олимпийские игры в Сиднее – Россия занимает второе место по общему числу медалей.',
      },
    ],
  },
  {
    theme: 'Интернет-технологии',
    events: [
      {
        date: '2006',
        description: 'Запуск социальной сети "ВКонтакте" в России, которая стала популярной по всей стране.',
      },
      {
        date: '2007',
        description:
          'Запуск iPhone компанией Apple – начало новой эры мобильных технологий, которые также проникли в Россию.',
      },
      {
        date: '2010',
        description:
          'Создание Instagram – новой популярной платформы для обмена фотографиями и видео, в том числе среди российских пользователей.',
      },
      {
        date: '2013',
        description: 'Запуск проекта "Яндекс.Директ" в России – значимый шаг в развитии интернет-рекламы.',
      },
      {
        date: '2016',
        description: 'Появление голосового ассистента "Алиса" от Яндекса, конкурирующего с мировыми аналогами.',
      },
      {
        date: '2020',
        description:
          'Пандемия COVID-19 ускоряет массовое внедрение удаленной работы и рост популярности видеосервисов, таких как Zoom, в России.',
      },
    ],
  },
];
